{
  "id": 106,
  "name": "David Mellis",
  "username": "david",
  "avatar_template": "/letter_avatar_proxy/v2/letter/d/aeb1de/{size}.png",
  "created_at": "2015-06-08T18:59:30.000Z",
  "cooked": "<p>We already have a standard for openness, in the form of the open-source hardware definition (<a href=\"http://www.oshwa.org/definition/\" rel=\"nofollow noopener\">http://www.oshwa.org/definition/</a>).</p>\n<p>I realize that many open-source hardware projects build on non-open source components. To me, the clearest way to handle this is to describe which parts (or levels) of a project are open-source, e.g. this project is an open-source circuit design (which uses non-open source components). Having a single standard, in my opinion, would definitely not mean excluding anything that’s built on non-open source components. Similarly, plenty of open-source software runs on non-open source operating systems.</p>\n<p>Mostly, I’m not sure how you’d define a clear of spectrum of openness, as the specifics seem likely to differ in every project. johnbeetem’s standard of “mostly open” already seems more restrictive than the current OSHW definition, and I doubt there’d be very many projects that could achieve his “fully open” standard. And while I think share-alike or not is a useful distinction, it’s not clear to me which you’d consider “more open”. Are there other thoughts on what the different levels would be?</p>",
  "post_number": 7,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:14.838Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 27,
  "incoming_link_count": 0,
  "reads": 4,
  "score": 2.15,
  "yours": false,
  "topic_id": 38,
  "topic_slug": "2-single-definition-of-openness-or-a-spectrum-of-options",
  "display_username": "David Mellis",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "We already have a standard for openness, in the form of the open-source hardware definition (http://www.oshwa.org/definition/). \n\nI realize that many open-source hardware projects build on non-open source components. To me, the clearest way to handle this is to describe which parts (or levels) of a project are open-source, e.g. this project is an open-source circuit design (which uses non-open source components). Having a single standard, in my opinion, would definitely not mean excluding anything that's built on non-open source components. Similarly, plenty of open-source software runs on non-open source operating systems.\n\nMostly, I'm not sure how you'd define a clear of spectrum of openness, as the specifics seem likely to differ in every project. johnbeetem's standard of \"mostly open\" already seems more restrictive than the current OSHW definition, and I doubt there'd be very many projects that could achieve his \"fully open\" standard. And while I think share-alike or not is a useful distinction, it's not clear to me which you'd consider \"more open\". Are there other thoughts on what the different levels would be?",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 8,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}