{
  "id": 108,
  "name": "m30jrs",
  "username": "m30jrs",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/e99b99/{size}.png",
  "created_at": "2015-06-09T01:23:12.000Z",
  "cooked": "<p><a class=\"mention\" href=\"/u/aharper\">@aharper</a> noted this issue could be referred back to the “spectrum vs single certification” question.  In my reply to that question I noted how the question of the inclusion of non-open/close/proprietary elements in the design was one dimension of openness with the units denoting at what level of the design the system was open (down to the atom … up to the integration of commercial systems into a system of systems).  In looking over the comments in this thread, I think I see an additional unit of measure:  the degree to which a non-open element is available.</p>\n<p>Consider the LEDs <a class=\"mention\" href=\"/u/aharper\">@aharper</a> mentions from the Arduino.  LEDs are a very commonly available component with well defined specifications.  Any vendor’s compatible LEDs could be reasonably substituted for the parts specified by the Ardunino team.  Compare this to a component that is only available from a single vendor and for which there is no easy substitution (or where the substitution is non-trivial).  I would argue the former example, while still not completely open (after all, it is not like everyone making an Arduino from scratch is going to be expected to construct their own LEDs), is more open than the latter example.</p>\n<p>I would further propose that it is worth discussing if and how to note this relative openness and when it matters.  I think it will clarify one of the places where the current definition (and community norms) is a little bit muddy, in particular how the availability of key components of OSHW projects ties those projects to the continued support of suppliers.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:15.011Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 137,
  "incoming_link_count": 0,
  "reads": 2,
  "score": 7.25,
  "yours": false,
  "topic_id": 39,
  "topic_slug": "3-certification-of-projects-with-non-open-components",
  "display_username": "m30jrs",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "@aharper noted this issue could be referred back to the \"spectrum vs single certification\" question.  In my reply to that question I noted how the question of the inclusion of non-open/close/proprietary elements in the design was one dimension of openness with the units denoting at what level of the design the system was open (down to the atom ... up to the integration of commercial systems into a system of systems).  In looking over the comments in this thread, I think I see an additional unit of measure:  the degree to which a non-open element is available.  \n\nConsider the LEDs @aharper mentions from the Arduino.  LEDs are a very commonly available component with well defined specifications.  Any vendor's compatible LEDs could be reasonably substituted for the parts specified by the Ardunino team.  Compare this to a component that is only available from a single vendor and for which there is no easy substitution (or where the substitution is non-trivial).  I would argue the former example, while still not completely open (after all, it is not like everyone making an Arduino from scratch is going to be expected to construct their own LEDs), is more open than the latter example.  \n\nI would further propose that it is worth discussing if and how to note this relative openness and when it matters.  I think it will clarify one of the places where the current definition (and community norms) is a little bit muddy, in particular how the availability of key components of OSHW projects ties those projects to the continued support of suppliers.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 705,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}