{
  "id": 112,
  "name": "m30jrs",
  "username": "m30jrs",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/e99b99/{size}.png",
  "created_at": "2015-06-09T19:54:13.000Z",
  "cooked": "<p>As a founder and board member of a non-profit, I sympathize deeply with the motivation to seek income streams for OSHWA.  Plus, I don’t think the idea of registration fees for certification (self-certified or completed by OSHWA) is out of line with other organizations or industries.  And, unlike open source software and the creative commons, OSHW has developed a very common business model (give away the bits and sell the atoms) that would easily support a sliding scale model.  If it was run on the honor system, it would require very little overhead for registrants and for OSHWA.</p>\n<p>Finally, for new projects there wouldn’t really be any difference between a sliding scale and no fee if the sliding scale started at $0.00.  So, I think it could be managed in a way that would address the concerns above about impacting adoption of OSHW.</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:15.387Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 10,
  "incoming_link_count": 0,
  "reads": 2,
  "score": 0.9,
  "yours": false,
  "topic_id": 42,
  "topic_slug": "6-should-certification-require-fees",
  "display_username": "m30jrs",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "As a founder and board member of a non-profit, I sympathize deeply with the motivation to seek income streams for OSHWA.  Plus, I don't think the idea of registration fees for certification (self-certified or completed by OSHWA) is out of line with other organizations or industries.  And, unlike open source software and the creative commons, OSHW has developed a very common business model (give away the bits and sell the atoms) that would easily support a sliding scale model.  If it was run on the honor system, it would require very little overhead for registrants and for OSHWA.  \n\nFinally, for new projects there wouldn't really be any difference between a sliding scale and no fee if the sliding scale started at $0.00.  So, I think it could be managed in a way that would address the concerns above about impacting adoption of OSHW.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 705,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}