{
  "id": 116,
  "name": "mattman",
  "username": "mattman",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/e47774/{size}.png",
  "created_at": "2015-06-11T00:50:37.000Z",
  "cooked": "<p>There will be a lot of exceptions that keep a project from reaching maximum open source. Not all of them will be under the developer’s control and not all of what’s under their control will be practical.</p>\n<p>For example, a project could have a legitimate open source license but be confined to American citizens by export control laws. I think that qualifies as open source in the minimal sense. Another example is that a project might have an open source license, and no restrictions, but require exotic materials or absurdly expensive processes. I think that also qualifies as open source in the minimal sense.</p>\n<p>So if a project is open source, but some of the components it depends on carry restrictions that are outside of the developer’s control, I think that still counts as minimally open source.</p>\n<p>It’s important to keep in mind that we really don’t want to say that every single thing the end result depends on has to be accessible enough for an under-skilled and under-capitalized person to control. The only projects that would qualify would be based on sharp sticks. A big part of open source is pushing technology forward and that requires depending on infrastructure and partnerships we can’t control. Who cares if a great chip is closed source? The design that uses it will be old news in two years anyway.</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:15.777Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 37,
  "incoming_link_count": 0,
  "reads": 2,
  "score": 2.25,
  "yours": false,
  "topic_id": 39,
  "topic_slug": "3-certification-of-projects-with-non-open-components",
  "display_username": "mattman",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "There will be a lot of exceptions that keep a project from reaching maximum open source. Not all of them will be under the developer's control and not all of what's under their control will be practical.\n\nFor example, a project could have a legitimate open source license but be confined to American citizens by export control laws. I think that qualifies as open source in the minimal sense. Another example is that a project might have an open source license, and no restrictions, but require exotic materials or absurdly expensive processes. I think that also qualifies as open source in the minimal sense. \n\nSo if a project is open source, but some of the components it depends on carry restrictions that are outside of the developer's control, I think that still counts as minimally open source. \n\nIt's important to keep in mind that we really don't want to say that every single thing the end result depends on has to be accessible enough for an under-skilled and under-capitalized person to control. The only projects that would qualify would be based on sharp sticks. A big part of open source is pushing technology forward and that requires depending on infrastructure and partnerships we can't control. Who cares if a great chip is closed source? The design that uses it will be old news in two years anyway.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 709,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}