{
  "id": 129,
  "name": "mbparks",
  "username": "mbparks",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/ecae2f/{size}.png",
  "created_at": "2015-06-12T14:40:26.000Z",
  "cooked": "<p>Wait, we want to promote “freedom and openness” yet we we want to add regulations and certifications. Seems pretty backwards to me.</p>\n<p>I never said that OSHWA is corrupt in the slightest, in fact I like the work they’ve done in educating people up to this point. But I am telling you as someone with a licensed professional engineering background that once you go do the road of “certifications” it becomes a money grab more than trying to promote better behavior and best practices. Just take a look at the metric crap ton of IT certifications and other quasi-engineering certification (LEED, CEM) that have popped up over the years. They have done absolutely zilcho to actually provide better quality to customers, they simply exist to feed themselves. The point is, you may start off with the best of intentions, but eventually a bureaucracy becomes self-sustaining even after it’s outlived it’s usefulness. And in this case, I question the usefulness at the outset. Consumers barely understand the difference between iOS and Android, look at the debacle with Microsoft and their Windows 8 versus Windows 8 RT problems. Open Source Hardware is way more obscure and unfortunately the average consumer just doesn’t care. Those in the maker and professionals space,s people who do care, are smart enough to know the difference. My point is the community of people that is actually interested enough to know the difference between OSHW and non-OSHW is smart enough to know the difference and we don’t need a nanny state-style certification to do this. Lastly, and perhaps most critically let’s say you do create a certification. What mechanism do you use to enforce it? Do you really want the governments of the world to regulate this industry that has become the cradle for innovation and STEAM education? Seems to me it will kill OSHW vice save it.</p>",
  "post_number": 10,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:16.966Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": null,
  "incoming_link_count": 0,
  "reads": 2,
  "score": 0.2,
  "yours": false,
  "topic_id": 37,
  "topic_slug": "1-is-certification-something-that-oshwa-should-be-looking-into-all",
  "display_username": "mbparks",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "Wait, we want to promote \"freedom and openness\" yet we we want to add regulations and certifications. Seems pretty backwards to me.\n\nI never said that OSHWA is corrupt in the slightest, in fact I like the work they've done in educating people up to this point. But I am telling you as someone with a licensed professional engineering background that once you go do the road of \"certifications\" it becomes a money grab more than trying to promote better behavior and best practices. Just take a look at the metric crap ton of IT certifications and other quasi-engineering certification (LEED, CEM) that have popped up over the years. They have done absolutely zilcho to actually provide better quality to customers, they simply exist to feed themselves. The point is, you may start off with the best of intentions, but eventually a bureaucracy becomes self-sustaining even after it's outlived it's usefulness. And in this case, I question the usefulness at the outset. Consumers barely understand the difference between iOS and Android, look at the debacle with Microsoft and their Windows 8 versus Windows 8 RT problems. Open Source Hardware is way more obscure and unfortunately the average consumer just doesn't care. Those in the maker and professionals space,s people who do care, are smart enough to know the difference. My point is the community of people that is actually interested enough to know the difference between OSHW and non-OSHW is smart enough to know the difference and we don't need a nanny state-style certification to do this. Lastly, and perhaps most critically let's say you do create a certification. What mechanism do you use to enforce it? Do you really want the governments of the world to regulate this industry that has become the cradle for innovation and STEAM education? Seems to me it will kill OSHW vice save it.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 710,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}