{
  "id": 141,
  "name": "mattman",
  "username": "mattman",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/e47774/{size}.png",
  "created_at": "2015-06-13T13:30:28.000Z",
  "cooked": "<p>Agreed, “hardware” in my mind is anything where the value is tangible or where the value can’t be captured digitally. You can look at pictures of cookies, and listen to descriptions of cookies, but the value of a cookie is in the eating.</p>\n<p>But if we’re going to create a “laundry list” it should be something abstract. We shouldn’t try to analyze each of the different things in the world for its potential openness like Electronic Openness and Mechanical Openness and Electro-mechanical Openness and on to infinity.</p>\n<p>Also, it shouldn’t hinge on things the developer can’t practically control. Like “instructions in multiple languages” would be fine for the maximum standard but not for the minimum standard.</p>",
  "post_number": 11,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:18.012Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 5,
  "incoming_link_count": 0,
  "reads": 3,
  "score": 0.85,
  "yours": false,
  "topic_id": 38,
  "topic_slug": "2-single-definition-of-openness-or-a-spectrum-of-options",
  "display_username": "mattman",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "Agreed, \"hardware\" in my mind is anything where the value is tangible or where the value can't be captured digitally. You can look at pictures of cookies, and listen to descriptions of cookies, but the value of a cookie is in the eating.\n\nBut if we're going to create a \"laundry list\" it should be something abstract. We shouldn't try to analyze each of the different things in the world for its potential openness like Electronic Openness and Mechanical Openness and Electro-mechanical Openness and on to infinity.\n\nAlso, it shouldn't hinge on things the developer can't practically control. Like \"instructions in multiple languages\" would be fine for the maximum standard but not for the minimum standard.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 709,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}