{
  "id": 156,
  "name": "mattman",
  "username": "mattman",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/e47774/{size}.png",
  "created_at": "2015-06-18T19:58:10.000Z",
  "cooked": "<p>To be fair, the question “should OSHWA make an OSHW certification” is not a settled question. That’s what this discussion is about. It might not be worth the trouble.</p>\n<p>If you want an OSHW certification to serve as a one-minute guarantee of the open-source-ness of a project then you’re definitely looking for something restrictive like the RYF cert.</p>\n<p>I don’t think that an open source certification is going to serve the same purpose as a free software certification. The FSF is motivated by purity of a clear moral standard. The RYF cert literally forbids a seller from using badge that says “works with windows” because it lends legitimacy to windows and also stipulates that the seller has to reference “free software” more often than they reference “open source.” They want to prevent as many projects as possible from being able to qualify so that the RYF cert means the project is absolutely perfect, up to and including the assertion that if free software for a secondary processor ever becomes available in the future, and the seller doesn’t build a fix or a whole new version to allow access to that secondary processor, the FSF will revoke the RYF cert.</p>\n<p>Open source split off from free software specifically because it focuses on maximum usefulness rather than maximum freedom. It would be inappropriate and counterproductive for an open source cert to be exclusionary. Particularly when hardware is so much more complicated than software and when OSHW is so much younger.</p>\n<p>Besides, a big part of the reason anybody would ever want a RYF cert is that the FSF has a globally recognized brand. OSHWA is basically unknown.</p>",
  "post_number": 15,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:19.494Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 7,
  "incoming_link_count": 0,
  "reads": 3,
  "score": 0.75,
  "yours": false,
  "topic_id": 37,
  "topic_slug": "1-is-certification-something-that-oshwa-should-be-looking-into-all",
  "display_username": "mattman",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "To be fair, the question \"should OSHWA make an OSHW certification\" is not a settled question. That's what this discussion is about. It might not be worth the trouble.\n\nIf you want an OSHW certification to serve as a one-minute guarantee of the open-source-ness of a project then you're definitely looking for something restrictive like the RYF cert. \n\nI don't think that an open source certification is going to serve the same purpose as a free software certification. The FSF is motivated by purity of a clear moral standard. The RYF cert literally forbids a seller from using badge that says \"works with windows\" because it lends legitimacy to windows and also stipulates that the seller has to reference \"free software\" more often than they reference \"open source.\" They want to prevent as many projects as possible from being able to qualify so that the RYF cert means the project is absolutely perfect, up to and including the assertion that if free software for a secondary processor ever becomes available in the future, and the seller doesn't build a fix or a whole new version to allow access to that secondary processor, the FSF will revoke the RYF cert.\n\nOpen source split off from free software specifically because it focuses on maximum usefulness rather than maximum freedom. It would be inappropriate and counterproductive for an open source cert to be exclusionary. Particularly when hardware is so much more complicated than software and when OSHW is so much younger. \n\nBesides, a big part of the reason anybody would ever want a RYF cert is that the FSF has a globally recognized brand. OSHWA is basically unknown.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 709,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}