{
  "id": 158,
  "name": "mattman",
  "username": "mattman",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/e47774/{size}.png",
  "created_at": "2015-06-24T13:08:57.000Z",
  "cooked": "<p>tedhall, I think this “…If what the designer/producer is contributing by way of design and innovation in the offering is fully open…” is the key. The most important factor is to only consider the things the designer has control over. The second most important factor is to consider what rights the designer gave away.</p>\n<p>There’s nothing we can do about the laws of physics. Some stuff just requires a high degree of knowledge and skill that have to be earned instead of merely documented. Some stuff just requires exotic materials or complicated processing. We can encourage best practices that emphasize easy to replicate designs, but that’s it.</p>\n<p>There’s not much we can do about good but not-open work. Everyone has the right to their own work and if they want to lock it down that’s their thing. We can try to influence them, but that won’t always work.</p>\n<p>What Open Source Hardware hinges on is the work that OSHW developers add to the world and the restrictions they put on other people’s right to use that work. <strong>If you give away your work, and the rights to it, then you’re doing open source development</strong>.</p>\n<p>Or, in a more general community sense, if you <strong>treat the rest of the world like everyone is on your team</strong>, then you’re living the spirit of open source development. As long as we have that the rest of the details will work themselves out.</p>",
  "post_number": 17,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:19.711Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 44,
  "incoming_link_count": 0,
  "reads": 3,
  "score": 2.6,
  "yours": false,
  "topic_id": 37,
  "topic_slug": "1-is-certification-something-that-oshwa-should-be-looking-into-all",
  "display_username": "mattman",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "tedhall, I think this \"...If what the designer/producer is contributing by way of design and innovation in the offering is fully open...\" is the key. The most important factor is to only consider the things the designer has control over. The second most important factor is to consider what rights the designer gave away. \n\nThere's nothing we can do about the laws of physics. Some stuff just requires a high degree of knowledge and skill that have to be earned instead of merely documented. Some stuff just requires exotic materials or complicated processing. We can encourage best practices that emphasize easy to replicate designs, but that's it. \n\nThere's not much we can do about good but not-open work. Everyone has the right to their own work and if they want to lock it down that's their thing. We can try to influence them, but that won't always work. \n\nWhat Open Source Hardware hinges on is the work that OSHW developers add to the world and the restrictions they put on other people's right to use that work. <strong>If you give away your work, and the rights to it, then you're doing open source development</strong>. \n\nOr, in a more general community sense, if you <strong>treat the rest of the world like everyone is on your team</strong>, then you're living the spirit of open source development. As long as we have that the rest of the details will work themselves out.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 709,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}