{
  "id": 181,
  "name": "pdxmanny",
  "username": "pdxmanny",
  "avatar_template": "/letter_avatar_proxy/v2/letter/p/b77776/{size}.png",
  "created_at": "2016-10-10T08:40:06.000Z",
  "cooked": "<p>Hi All,</p>\n<p>At the 2016 OSHWA Event here in Portland, there was an interesting question that came up when a person who creates an Open Source Hardware project/product who has the rights to the product when the product was associated with a company and the creator moves onto another company or works on their own; for whatever reason? Although the current certification process does not address this specific senario, an idea came to me that hopefully will get some consideration. A very quick answer to the “situation” is that both the creator and the company will have joint rights to the product’s certification. Which given this idea, it also raised the question of who should be registering the product idea with OSHWA? I would like to throw out the answer to this question being the individual who either came up with the idea for the product and/or whoever was the main contributor to the product’s development and creation.</p>\n<pre><code>While most products are so complex theses days it is not developed by just one person, so the certification process should also consider the ability to add the names of additional co-creators to a given product. As long as all parties adhere to the requirements of the certification, all creator(s) and the company should have the right to assert that a given product is OSHWA certified using the same number assigned by OSHWA to a specific OSHWA certified product.\n</code></pre>\n<p>These are just some thoughts to think about and I hope that they help in some way, as I look forward to purchase a product that is OSHWA certified in the very near future!</p>\n<pre><code>- Manny</code></pre>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:21.935Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 23,
  "incoming_link_count": 6,
  "reads": 6,
  "score": 32.35,
  "yours": false,
  "topic_id": 55,
  "topic_slug": "when-ties-between-a-creator-and-company-break",
  "display_username": "pdxmanny",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "Hi All,\n\n   At the 2016 OSHWA Event here in Portland, there was an interesting question that came up when a person who creates an Open Source Hardware project/product who has the rights to the product when the product was associated with a company and the creator moves onto another company or works on their own; for whatever reason? Although the current certification process does not address this specific senario, an idea came to me that hopefully will get some consideration. A very quick answer to the \"situation\" is that both the creator and the company will have joint rights to the product's certification. Which given this idea, it also raised the question of who should be registering the product idea with OSHWA? I would like to throw out the answer to this question being the individual who either came up with the idea for the product and/or whoever was the main contributor to the product's development and creation.\n\n    While most products are so complex theses days it is not developed by just one person, so the certification process should also consider the ability to add the names of additional co-creators to a given product. As long as all parties adhere to the requirements of the certification, all creator(s) and the company should have the right to assert that a given product is OSHWA certified using the same number assigned by OSHWA to a specific OSHWA certified product.\n\n   These are just some thoughts to think about and I hope that they help in some way, as I look forward to purchase a product that is OSHWA certified in the very near future!\n\n    - Manny",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 771,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}