{
  "id": 223,
  "name": "",
  "username": "Jonathan",
  "avatar_template": "/letter_avatar_proxy/v2/letter/j/aeb1de/{size}.png",
  "created_at": "2017-03-08T17:10:54.272Z",
  "cooked": "<p>Hi,<br>\nIn the last years, the term Open Source is used to describe a public and gratis distribution of construction and architectural plans. One of the most interesting examples of the last years is <a href=\"http://www.elementalchile.cl/en/projects/abc-of-incremental-housing/\" rel=\"nofollow noopener\">Alejandro Aravena’s social housing blue prints</a> as “Open Source”.<br>\nI’ve used the quotes in order to emphasize the fact that he didn’t Open-Source these plans, he just distributed them for free, without a proper license.</p>\n<p>There has been a book published under the name “<a href=\"https://www.amazon.com/Open-Source-Architecture-Carlo-Ratti/dp/0500343063\" rel=\"nofollow noopener\">Open Source Architecture</a>” by Claudel and Ratti from MIT, where they claim that Open Source is going to diminish the architects and move the creative process to the stake holders.   In my view open source might facilitates a free knowledge exchange and professionalism rather then “Download and modify free plans from the web”.</p>\n<p>There’s much confusion an disinformation about open source in domain of architecture that prevents adaptation of the open source model in this industry.</p>\n<p>What is the status of construction and architecture within the scope of OSHWA?</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2017-03-08T17:10:54.272Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 32,
  "incoming_link_count": 3,
  "reads": 12,
  "score": 34.0,
  "yours": false,
  "topic_id": 73,
  "topic_slug": "open-source-architecture-and-construction",
  "display_username": "",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "Hi,\nIn the last years, the term Open Source is used to describe a public and gratis distribution of construction and architectural plans. One of the most interesting examples of the last years is [Alejandro Aravena's social housing blue prints](http://www.elementalchile.cl/en/projects/abc-of-incremental-housing/) as \"Open Source\".\nI've used the quotes in order to emphasize the fact that he didn't Open-Source these plans, he just distributed them for free, without a proper license.\n\nThere has been a book published under the name \"[Open Source Architecture](https://www.amazon.com/Open-Source-Architecture-Carlo-Ratti/dp/0500343063)\" by Claudel and Ratti from MIT, where they claim that Open Source is going to diminish the architects and move the creative process to the stake holders.   In my view open source might facilitates a free knowledge exchange and professionalism rather then \"Download and modify free plans from the web\".\n\nThere's much confusion an disinformation about open source in domain of architecture that prevents adaptation of the open source model in this industry. \n\nWhat is the status of construction and architecture within the scope of OSHWA?",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1032,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}