{
  "id": 339,
  "name": "Christopher Daniels",
  "username": "cuvtixo",
  "avatar_template": "/user_avatar/community.oshwa.org/cuvtixo/{size}/41_1.png",
  "created_at": "2018-04-03T21:12:01.753Z",
  "cooked": "<p>I’m neither a lawyer, nor programmer, just a paralegal in previous life, but a couple of things I will say about this, Firstly, <a href=\"https://en.wikipedia.org/wiki/GNU_General_Public_License\" rel=\"nofollow noopener\">GNU_General_Public_License</a> and other Open Source licenses address this with fairly typical legal disclaimers. This is why some say it’s fairly important to actually include such licenses, (and force people to click on them) in any product: software, hardware or firmware, instead of just releasing a product into the Public Domain. Please get as much familiarity as possible before using them. Read Them! Again, I’m no authority on GNU licenses, and I believe there’s not actually much testing of the legal validity of Open Source licenses in courts (case law is supremely important in Common Law “English” type systems, like in the US, Canada, Great Britain, etc. Your responsibilities in Civil Law systems, as in much of Europe, may be different.) Secondly, in the US, the point of going after designers is when they have deep pockets- when the manufacturers and sellers don’t. One of the reasons there hasn’t been a whole lot of case law on Open Source, is the designers are often penniless, or at least not as wealthy as manufacturers, etc… Not good targets for lawsuits, although that’s no protection, as someone with a grudge or agenda might not care about the money, and/or have more of interest in bankrupting or putting you out of business. I mention this only to remind you to keep things in perspective, since any professional opinion you solicit might be inspired by their own business interests, and give only the most alarmist hypothetical situations. If you have no money, you’ll be small, if not invisible, to lawyers in the vast majority of cases. And most people will not be interested in putting a designer of products for the physically disabled out of business, and a good lawyer will point out the small-mindedness of such attempts if s/he can.<br>\nThe GNU people have put a lot of thought into such matters as legal responsibility: it’s one reason their on Version 3, instead of leaving the first version alone. Check out the language in it sometime, instead of clicking mindlessly, as we often do, me included.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2018-04-03T21:23:55.699Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 30,
  "incoming_link_count": 0,
  "reads": 12,
  "score": 3.9,
  "yours": false,
  "topic_id": 173,
  "topic_slug": "does-open-source-hardware-software-has-any-legal-responsibilities",
  "display_username": "Christopher Daniels",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "I'm neither a lawyer, nor programmer, just a paralegal in previous life, but a couple of things I will say about this, Firstly, [GNU_General_Public_License](https://en.wikipedia.org/wiki/GNU_General_Public_License) and other Open Source licenses address this with fairly typical legal disclaimers. This is why some say it's fairly important to actually include such licenses, (and force people to click on them) in any product: software, hardware or firmware, instead of just releasing a product into the Public Domain. Please get as much familiarity as possible before using them. Read Them! Again, I'm no authority on GNU licenses, and I believe there's not actually much testing of the legal validity of Open Source licenses in courts (case law is supremely important in Common Law \"English\" type systems, like in the US, Canada, Great Britain, etc. Your responsibilities in Civil Law systems, as in much of Europe, may be different.) Secondly, in the US, the point of going after designers is when they have deep pockets- when the manufacturers and sellers don't. One of the reasons there hasn't been a whole lot of case law on Open Source, is the designers are often penniless, or at least not as wealthy as manufacturers, etc.. Not good targets for lawsuits, although that's no protection, as someone with a grudge or agenda might not care about the money, and/or have more of interest in bankrupting or putting you out of business. I mention this only to remind you to keep things in perspective, since any professional opinion you solicit might be inspired by their own business interests, and give only the most alarmist hypothetical situations. If you have no money, you'll be small, if not invisible, to lawyers in the vast majority of cases. And most people will not be interested in putting a designer of products for the physically disabled out of business, and a good lawyer will point out the small-mindedness of such attempts if s/he can.\nThe GNU people have put a lot of thought into such matters as legal responsibility: it's one reason their on Version 3, instead of leaving the first version alone. Check out the language in it sometime, instead of clicking mindlessly, as we often do, me included.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1074,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}