{
  "id": 49,
  "name": "bobc",
  "username": "bobc",
  "avatar_template": "/letter_avatar_proxy/v2/letter/b/85f322/{size}.png",
  "created_at": "2014-08-11T17:15:08.000Z",
  "cooked": "<blockquote> Consequently, you <strong>cannot</strong> advertise your project or product as “open source” if it carries restrictions against either of those uses.</blockquote>\n<p>Unfortunately, you can, and people very frequently do. People can use words how they like, within legal restrictions.</p>\n<p>Unless “Open Source” or similar term is trademarked, there is nothing to stop people abusing it. Of course, even with trademark, it still requires active monitoring and lawyerly letters to enforce the trademark.</p>\n<p>Sadly, CC seems to have taken over “Open Source” (probably unintentionally), and now everyone thinks that CC = Open Source.</p>\n<p>Companies (and individuals) who think that Open Source is the cool thing to do, and probably carries some marketing value, who probably have not read the Open Source statement of principles, and who want to protect their “IP” investment, look down the list of CC licenses until the find the CC-BY-NC version and think “great! An Open license with an NC clause, that’s perfect for us!”</p>\n<p>These companies very deliberately use the “Open Source” term, and also deliberately choose the CC-BY-NC license - these are not accidental. While they can get away with it, they will.</p>\n<p>The worst thing about CC-BY-NC is that it claims <em>more restrictive</em> rights than users are legally entitled. If you make a physical object, you own it, you are entitled to sell it, provided you don’t infringe any trademarks or patents, or pass it off as original or whatever. In general, Copyright does not apply to physical objects.<br>\nHowever, CC-BY-NC applied to hardware claims that <em>you are not allowed to sell items you own</em> (I have seen this stated by one company).</p>\n<p>CC-BY-NC is not just not Open, it’s anti-Open. Now everyone is using it for hardware designs.</p>\n<p>Something somewhere went badly wrong.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:08.732Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 13,
  "incoming_link_count": 0,
  "reads": 2,
  "score": 1.05,
  "yours": false,
  "topic_id": 25,
  "topic_slug": "on-creative-commons-and-open-source",
  "display_username": "bobc",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "<blockquote> Consequently, you <strong>cannot</strong> advertise your project or product as “open source” if it carries restrictions against either of those uses.</blockquote>\n\nUnfortunately, you can, and people very frequently do. People can use words how they like, within legal restrictions.\n\nUnless \"Open Source\" or similar term is trademarked, there is nothing to stop people abusing it. Of course, even with trademark, it still requires active monitoring and lawyerly letters to enforce the trademark.\n\nSadly, CC seems to have taken over \"Open Source\" (probably unintentionally), and now everyone thinks that CC = Open Source.\n\nCompanies (and individuals) who think that Open Source is the cool thing to do, and probably carries some marketing value, who probably have not read the Open Source statement of principles, and who want to protect their \"IP\" investment, look down the list of CC licenses until the find the CC-BY-NC version and think \"great! An Open license with an NC clause, that's perfect for us!\"\n\nThese companies very deliberately use the \"Open Source\" term, and also deliberately choose the CC-BY-NC license - these are not accidental. While they can get away with it, they will.\n\nThe worst thing about CC-BY-NC is that it claims <em>more restrictive</em> rights than users are legally entitled. If you make a physical object, you own it, you are entitled to sell it, provided you don't infringe any trademarks or patents, or pass it off as original or whatever. In general, Copyright does not apply to physical objects.\nHowever, CC-BY-NC applied to hardware claims that <em>you are not allowed to sell items you own</em> (I have seen this stated by one company).\n\nCC-BY-NC is not just not Open, it's anti-Open. Now everyone is using it for hardware designs. \n\nSomething somewhere went badly wrong.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 202,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}