{
  "id": 51,
  "name": "gonzo",
  "username": "gonzo",
  "avatar_template": "/letter_avatar_proxy/v2/letter/g/838e76/{size}.png",
  "created_at": "2014-09-14T15:11:25.000Z",
  "cooked": "<p>Hello, I watched your videos, there would be many things to say, but I will try to address your main question directly:</p>\n<p>First, we must try to gather all the Open Source Hardware supporters on a single forum like this one. We should try to provide a meeting place for all the OSH supporters.</p>\n<p>Second, we should focus on what the people need:</p>\n<ul>\n<li>The people need to buy machines at decent prices and to repair them quick and cheap. That means we don’t have to only design the machines, but we have to build and to sell machines and parts for those machines. Also it’s very important to start with the most popular machines, in order to achieve our goals as fast as possible. Most of the people need home appliances (washing machines, refrigerators, coffeemakers etc), not open source DDRAM or hard disks or Arduinos.</li>\n<li>The people need jobs, so Open Source Hardware will allow the average citizen to create their own workshops to produce parts for open source machines. OSH will democratize jobs.</li>\n</ul>\n<p>So let’s think about what the people need most and let’s try to address their needs.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:08.944Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 2,
  "incoming_link_count": 0,
  "reads": 3,
  "score": 0.7,
  "yours": false,
  "topic_id": 27,
  "topic_slug": "how-can-we-better-collaborate",
  "display_username": "gonzo",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "Hello, I watched your videos, there would be many things to say, but I will try to address your main question directly:\n\nFirst, we must try to gather all the Open Source Hardware supporters on a single forum like this one. We should try to provide a meeting place for all the OSH supporters.\n\nSecond, we should focus on what the people need:\n- The people need to buy machines at decent prices and to repair them quick and cheap. That means we don't have to only design the machines, but we have to build and to sell machines and parts for those machines. Also it's very important to start with the most popular machines, in order to achieve our goals as fast as possible. Most of the people need home appliances (washing machines, refrigerators, coffeemakers etc), not open source DDRAM or hard disks or Arduinos.\n- The people need jobs, so Open Source Hardware will allow the average citizen to create their own workshops to produce parts for open source machines. OSH will democratize jobs.\n\nSo let's think about what the people need most and let's try to address their needs.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 282,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}