{
  "id": 52,
  "name": "gonzo",
  "username": "gonzo",
  "avatar_template": "/letter_avatar_proxy/v2/letter/g/838e76/{size}.png",
  "created_at": "2014-09-14T15:26:50.000Z",
  "cooked": "<p>Unfortunately, I noticed that many OSH supporters become concerned and even obsessed about details and they forget about the perspective.</p>\n<p>Many people at Open Source Ecology (OSE) are fans of Jaque Fresco’s Venus Project and they keep talking about Resource Based Economy (RBE). Others want to re-build the civilization from scratch. Others are obsessed about making everything open source: even hard disks or flash memory.</p>\n<p>The reality is simple: the average citizen doesn’t know and doesn’t want to know much about open source. They just want to repair their machines for cheap and quick. They also need to be able to open their own production facilities. Therefore we need to create and sell first the machines that the people need the most.</p>\n<p>Other than that, I think you are unnecessarily complicating yourself: no need to re-design the whole society (I noticed you struggle to design a way to share work and benefits). OSH will democratize the means of production, the industry giants will fall and small production facilities will emerge, where the many can have a job or where they will employ themselves.<br>\nThe big companies are not really competing, they just call themselves “industry”. In reality they are a collection of monopolies - they never compete for providing parts for their machines. OSH will simply remove the monopolies and will create a real, de-centralized industry.<br>\nBut in order to get there we must care about the needs of the many: We have to build popular machines first.</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:09.049Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": null,
  "incoming_link_count": 0,
  "reads": 1,
  "score": 0.2,
  "yours": false,
  "topic_id": 27,
  "topic_slug": "how-can-we-better-collaborate",
  "display_username": "gonzo",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "Unfortunately, I noticed that many OSH supporters become concerned and even obsessed about details and they forget about the perspective.\n\nMany people at Open Source Ecology (OSE) are fans of Jaque Fresco's Venus Project and they keep talking about Resource Based Economy (RBE). Others want to re-build the civilization from scratch. Others are obsessed about making everything open source: even hard disks or flash memory.\n\nThe reality is simple: the average citizen doesn't know and doesn't want to know much about open source. They just want to repair their machines for cheap and quick. They also need to be able to open their own production facilities. Therefore we need to create and sell first the machines that the people need the most.\n\nOther than that, I think you are unnecessarily complicating yourself: no need to re-design the whole society (I noticed you struggle to design a way to share work and benefits). OSH will democratize the means of production, the industry giants will fall and small production facilities will emerge, where the many can have a job or where they will employ themselves.\nThe big companies are not really competing, they just call themselves \"industry\". In reality they are a collection of monopolies - they never compete for providing parts for their machines. OSH will simply remove the monopolies and will create a real, de-centralized industry.\nBut in order to get there we must care about the needs of the many: We have to build popular machines first.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 282,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}