{
  "id": 679,
  "name": "Pavel Snajdr",
  "username": "snajpa",
  "avatar_template": "/letter_avatar_proxy/v2/letter/s/97f17d/{size}.png",
  "created_at": "2019-01-04T17:34:46.942Z",
  "cooked": "<aside class=\"quote no-group\" data-post=\"1\" data-topic=\"341\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt width=\"20\" height=\"20\" src=\"//community.oshwa.org/letter_avatar_proxy/v2/letter/j/bc79bd/40.png\" class=\"avatar\"> jt_eaton:</div>\n<blockquote>\n<p>ORCONF</p>\n</blockquote>\n</aside>\n<p>Hello guys,</p>\n<p>I’m here to chime in on joining OSHW Summit with a bigger conference; yet I would like to propose yet another level up:</p>\n<p>here in Brno, CZ, every year for the past 10+ years we have OpenAlt, it’s been a local CZ community event (~700 attendees over the weekend), evangelizing open-source to our local guys here. The original organizational team is kind of tired of stagnation of CZ community, when it comes to growth - honestly, everyone, who could be doing open-source is already on baord in some way.</p>\n<p>So for 2019, we’ve decided to step it up a bit and invite various different communities to this local community event, scale it up and capitalize on our skill to organize such events.</p>\n<p>If I let my imagination run freely (and assuming we can see this vision commonly) - I could imagine having ORCONF in Brno, joining it with OSHW Summit - it would be best in line with our goals, as CZ/SK hacker community.</p>\n<p>We, over the years, want to open up all of the industrial automation, from the base level - personally I’ve started from the datacenter point of view with <a href=\"http://vpsFree.org\" rel=\"nofollow noopener\">vpsFree.org</a> -&gt; now with base48.cz we’re progressing down the stack, by being economically active community, which has useful outputs for the outside world.</p>\n<p>For 2019, I’ve managed to get the NixOS guys on board with their NixCon, NixOS is a next-gen declaratively configurable Linux distribution and with our guys @ base48, we’re trying to bring it towards more embedded environments. Reproducible, mass-scale-updatable deployments based on some serious academic work - that would be the catchphrase for NixOS.</p>\n<p>Now, I’m trying to persuade the Open FPGA development hacker community to join us too;<br>\nit would be awesome to put this all together and stream all of us meeting together to the outside world.</p>\n<p>As a statement that something really serious is becoming of all of these efforts that our community together has been kicking for - for quite a long time now!</p>\n<p>Please, don’t hesitate to reimagine it even a few levels up - the only thing I would mention here, is that it’s Jan 2019 now and if we’d like to make it for the traditional OpenAlt date, which is the first weekend of November, now would be the best time to start putting all of this together <img src=\"//community.oshwa.org/images/emoji/twitter/wink.png?v=5\" title=\":wink:\" class=\"emoji\" alt=\":wink:\"></p>\n<p>That is to say that we have two guys ready to work full-time on this to get a lot of the preparation work done.</p>\n<p>Cheers!</p>\n<p>/snajpa<br>\n(Pavel Snajdr, +420 720 107 791, <a href=\"https://twitter.com/PavelSnajdr\" rel=\"nofollow noopener\">https://twitter.com/PavelSnajdr</a>)</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2019-01-04T17:34:46.942Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 1,
  "avg_time": 46,
  "incoming_link_count": 0,
  "reads": 7,
  "score": 8.7,
  "yours": false,
  "topic_id": 341,
  "topic_slug": "colocating-conferences",
  "display_username": "Pavel Snajdr",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "[quote=\"jt_eaton, post:1, topic:341\"]\nORCONF\n[/quote]\n\nHello guys,\n\nI'm here to chime in on joining OSHW Summit with a bigger conference; yet I would like to propose yet another level up:\n\nhere in Brno, CZ, every year for the past 10+ years we have OpenAlt, it's been a local CZ community event (~700 attendees over the weekend), evangelizing open-source to our local guys here. The original organizational team is kind of tired of stagnation of CZ community, when it comes to growth - honestly, everyone, who could be doing open-source is already on baord in some way.\n\nSo for 2019, we've decided to step it up a bit and invite various different communities to this local community event, scale it up and capitalize on our skill to organize such events.\n\nIf I let my imagination run freely (and assuming we can see this vision commonly) - I could imagine having ORCONF in Brno, joining it with OSHW Summit - it would be best in line with our goals, as CZ/SK hacker community.\n\nWe, over the years, want to open up all of the industrial automation, from the base level - personally I've started from the datacenter point of view with vpsFree.org -> now with base48.cz we're progressing down the stack, by being economically active community, which has useful outputs for the outside world.\n\nFor 2019, I've managed to get the NixOS guys on board with their NixCon, NixOS is a next-gen declaratively configurable Linux distribution and with our guys @ base48, we're trying to bring it towards more embedded environments. Reproducible, mass-scale-updatable deployments based on some serious academic work - that would be the catchphrase for NixOS.\n\nNow, I'm trying to persuade the Open FPGA development hacker community to join us too;\nit would be awesome to put this all together and stream all of us meeting together to the outside world.\n\nAs a statement that something really serious is becoming of all of these efforts that our community together has been kicking for - for quite a long time now!\n\nPlease, don't hesitate to reimagine it even a few levels up - the only thing I would mention here, is that it's Jan 2019 now and if we'd like to make it for the traditional OpenAlt date, which is the first weekend of November, now would be the best time to start putting all of this together ;)\n\nThat is to say that we have two guys ready to work full-time on this to get a lot of the preparation work done.\n\nCheers!\n\n/snajpa\n(Pavel Snajdr, +420 720 107 791, https://twitter.com/PavelSnajdr)",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1144,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}