{
  "id": 718,
  "name": "Diderik van Wingerden",
  "username": "mnot",
  "avatar_template": "/user_avatar/community.oshwa.org/mnot/{size}/36_1.png",
  "created_at": "2019-04-29T18:08:44.941Z",
  "cooked": "<p>My advice is to go for an open source-compatible license (set) that is permissive, unless you have a really good reason from gathered solid evidence by doing research and experimentation with users/customers to go for something else.</p>\n<p>It looks like you have a mission-driven organization with an organizational model where community is key (“make soil together on a planet-saving scale”). Giving the community (or anyone) the freedom and permission to innovate and do what they believe is the right thing to achieve that mission, including (also) making some money in order to be sustainable is the way to go. Also understand that “bad actors will act bad” and “good actors will act good” no matter which license sticker you put on your knowledge.</p>\n<p>I have experience using an open source-compatible copyleft license set for our hardware designs and in hindsight that was not a good choice. The copyleft-clause prevented other entrepreneurs from engaging, as they did not understand what it meant and found it too risky or too much work to get over that.</p>\n<p>Lastly, a “suggested donation” is just a suggestion. You can also do that with an open source-compatible (and hence not non-commercial) license.</p>\n<p>Hope this helps…</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2019-04-29T18:08:55.269Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 115,
  "incoming_link_count": 1,
  "reads": 4,
  "score": 16.55,
  "yours": false,
  "topic_id": 441,
  "topic_slug": "dual-license-free-for-personal-fee-for-commercial",
  "display_username": "Diderik van Wingerden",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "My advice is to go for an open source-compatible license (set) that is permissive, unless you have a really good reason from gathered solid evidence by doing research and experimentation with users/customers to go for something else.\n\nIt looks like you have a mission-driven organization with an organizational model where community is key (\"make soil together on a planet-saving scale\"). Giving the community (or anyone) the freedom and permission to innovate and do what they believe is the right thing to achieve that mission, including (also) making some money in order to be sustainable is the way to go. Also understand that \"bad actors will act bad\" and \"good actors will act good\" no matter which license sticker you put on your knowledge.\n\nI have experience using an open source-compatible copyleft license set for our hardware designs and in hindsight that was not a good choice. The copyleft-clause prevented other entrepreneurs from engaging, as they did not understand what it meant and found it too risky or too much work to get over that.\n\nLastly, a \"suggested donation\" is just a suggestion. You can also do that with an open source-compatible (and hence not non-commercial) license.\n\nHope this helps..",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 714,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}