{
  "id": 754,
  "name": "Justin  White",
  "username": "blazini",
  "avatar_template": "/letter_avatar_proxy/v2/letter/b/ea666f/{size}.png",
  "created_at": "2019-08-28T23:23:13.795Z",
  "cooked": "<p>I’m working on finishing up a PCB design, it’s original intention was to be part of a machine I designed and that machine has only a commercial application. However, the PCB in particular is quite useful for many different types of machines. Ive been thinking about releasing the design files as OSHW but I am a little concerned with the effect that would have on the version that is included in the machine. There wouldn’t be many differences to the original design other than silscreened logos, the main concern is that the board included with the commercial machine would not include design files, would have copyrighted logos, and possibly undergo design revisions that the OSHW does not receive.</p>\n<p>I’m not really concerned a whole lot about the OSHW design what people do with it, I’m more worried about limitations I’d have to be concerned about when using the board for it’s original intent.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2019-08-28T23:23:13.795Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 21,
  "incoming_link_count": 2,
  "reads": 5,
  "score": 12.05,
  "yours": false,
  "topic_id": 474,
  "topic_slug": "releasing-oshw-alongside-non-oshw-version",
  "display_username": "Justin  White",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "I'm working on finishing up a PCB design, it's original intention was to be part of a machine I designed and that machine has only a commercial application. However, the PCB in particular is quite useful for many different types of machines. Ive been thinking about releasing the design files as OSHW but I am a little concerned with the effect that would have on the version that is included in the machine. There wouldn't be many differences to the original design other than silscreened logos, the main concern is that the board included with the commercial machine would not include design files, would have copyrighted logos, and possibly undergo design revisions that the OSHW does not receive.  \n\nI'm not really concerned a whole lot about the OSHW design what people do with it, I'm more worried about limitations I'd have to be concerned about when using the board for it's original intent.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1162,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}