{
  "id": 77,
  "name": "abetusk",
  "username": "abetusk",
  "avatar_template": "/user_avatar/community.oshwa.org/abetusk/{size}/42_1.png",
  "created_at": "2015-06-07T12:24:23.000Z",
  "cooked": "<p>My fear is that not letting companies self certify will have a chilling effect on adopting the open source hardware certification.  I have a few small open source projects of my own and don’t want to go through the hassle of asking permission from the OSI to use their trademarked logo even though my software is fully free and open.</p>\n<p>My belief is that the risk of bad actors self-certifying as being open source hardware is low.  If through ignorance they’ve certified themselves as being open source hardware when they’re not, a gentle reminder to either remove the certification or comply with the open source hardware definitions will probably solve most cases.  In the few cases where bad actors refuse to remove the certification but won’t comply with the open source hardware definition, litigation can be pursued.  I imagine this to a be a rare and extreme case, only pursued when all other options have been explored.</p>\n<p>I believe that it’s better to trust that most people who want to put the open source hardware certification on their projects are genuine about their intention to be open source hardware compliant.  My bet is that giving the community the benefit of the doubt will go much further than bogging down certification with approval processes and fees attached.</p>\n<p>I also think simpler is better.  Having people differentiate between bronze, silver and gold seems like it will just dilute the idea.  My feeling is that it’s better to have one certifications that will give a clear signal.</p>\n<p>I would be for adding an additional level of certification on top of being open source hardware compliant.  Something like ‘OSHWA approved’, maybe with the text ‘OSHWA’ and a check mark next to it.  This could have fees attached as to get OSHWA approval as there would be a need to process and approve an application.  I hope I’m not being pedantic but for the end consumer, the little sigil or small piece of text on a PCB is the thing they see.  If the sigil or text on the PCB isn’t distinct enough, confusion follows.</p>",
  "post_number": 4,
  "post_type": 1,
  "updated_at": "2017-02-14T04:29:11.805Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 6,
  "incoming_link_count": 1,
  "reads": 2,
  "score": 5.7,
  "yours": false,
  "topic_id": 40,
  "topic_slug": "4-self-certification-or-pre-approval-process-by-oshwa",
  "display_username": "abetusk",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "My fear is that not letting companies self certify will have a chilling effect on adopting the open source hardware certification.  I have a few small open source projects of my own and don't want to go through the hassle of asking permission from the OSI to use their trademarked logo even though my software is fully free and open.\n\nMy belief is that the risk of bad actors self-certifying as being open source hardware is low.  If through ignorance they've certified themselves as being open source hardware when they're not, a gentle reminder to either remove the certification or comply with the open source hardware definitions will probably solve most cases.  In the few cases where bad actors refuse to remove the certification but won't comply with the open source hardware definition, litigation can be pursued.  I imagine this to a be a rare and extreme case, only pursued when all other options have been explored.\n\nI believe that it's better to trust that most people who want to put the open source hardware certification on their projects are genuine about their intention to be open source hardware compliant.  My bet is that giving the community the benefit of the doubt will go much further than bogging down certification with approval processes and fees attached.\n\nI also think simpler is better.  Having people differentiate between bronze, silver and gold seems like it will just dilute the idea.  My feeling is that it's better to have one certifications that will give a clear signal.\n\nI would be for adding an additional level of certification on top of being open source hardware compliant.  Something like 'OSHWA approved', maybe with the text 'OSHWA' and a check mark next to it.  This could have fees attached as to get OSHWA approval as there would be a need to process and approve an application.  I hope I'm not being pedantic but for the end consumer, the little sigil or small piece of text on a PCB is the thing they see.  If the sigil or text on the PCB isn't distinct enough, confusion follows.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 701,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}