{
  "id": 806,
  "name": "Devd Roberts",
  "username": "Devd",
  "avatar_template": "/letter_avatar_proxy/v2/letter/d/f08c70/{size}.png",
  "created_at": "2022-06-18T04:11:06.773Z",
  "cooked": "<p>So I realize your post is semi-old-ish… but not as old as Inter-Switch Link was when Cisco finally admitted they lost and killed it.  I see a lot of potential in what you are trying to do.  Most mid-sized/small data centers can not commit to full packaged DCIM platforms.  At that most are modular with almost zero chance of figuring out what is needed (Unless you work for them… looking at you Solar Winds… what the hell is per virtual core physical node basic licensing anyway?  It is like everyone waiting for Oracle to sue them for because we can not figure out how to license something that doesn’t exist).  Almost everyone I have seen either gives up or hires a consultant to fix it… and within a year is back to zero.  So even when they try… they still fail.</p>\n<p>Typical Customer Conversation</p>\n<p>Customer : I have heard of this cool thing called “insert Software Solution” and it only cost 3.99 a month!</p>\n<p>Me : Yeah.  3.99 a month for per node connectivity without additional services or configuration</p>\n<p>Customer : Oh cool!  So I must just be a single node!  Lets do it!  Cheap and easy!</p>\n<p>Me …</p>\n<p>Customer : Oh, by the way.  Have you figured out my baseline?</p>\n<p>Foundationally physical control is the start point of security.  If it can be touched, it can be owned.  (Anyone remember renaming the CMD.exe to Utilman.exe?)  We have all heard stories of the root bridge being in the closet of a branch office.  Or the 16 year old guy that broke the iPhone hours after release.  Or the annoyed Admin looking for live boot disk and being annoyed it isn’t their “favorite” distro as they break every known security measure Linux or Windows has to offer?)</p>\n<p>90 plus percent of failed infrastructure processes could be avoided by proper asset management.  Raise your hands if you have ever been somewhere that has the most beautiful CM process ever written, super great patching policies, great lifecycle documents… and the first server you touch has some Heartbleed level exploit available because they never attached the hardware to the policy?  (Looking at you DoD, every Federal/state GOVT CIO… great policy too bad you don’t follow them, I just left Amy’s Cupcake Factory and her POS network is more secure… good luck on air gap and Security Through Obscurity)</p>\n<p>Sadly the worst environments for “baseline” tracking tend to be the small security enclaves.  (Hey Lockheed, that is a super nice advanced fighter jet China is flying.  What is it called? Is that the F-22 Raptor, opps, nope, must be the MV-22 Osprey, ahh rats… here, just take the F-35.)</p>\n<p>What I am saying is I see a LOT of potential for what you are proposing here.  I think it needs a lot of up front conversations, the biggest conversation is often the tools of the good guys become the tools of the bad guys.  Knee jerk reactions often mean organizations have already banned the tech that could save them… how can that be overcome? Tell most Security Mangers you are about to deploy RFID tags and they will get their “faraday cage” wallets and tin hats, totally forgetting how they just opened the door.</p>\n<p>A very legit strategy is to use same tech but call it something different, no one checks anyway, that is effort.</p>\n<p>Company : We use SMART, Super Modern Asymmetrical Relay Technology, to deliver a super fast stream of information.</p>\n<p>Customer : TAKE MY MONEY</p>\n<p>Everyone else : Wait, did they just sell UDP as their own product</p>\n<p>or</p>\n<p>Google : Hey guys we just made this thing called QUIC and we are awesome, it is free (Please ignore the data scraping)</p>\n<p>The World : Thank you for SAVING us from slow internet</p>\n<p>Everyone else : Wait, did you add ARQ to UDP? Or just improve TCP with fewer acks?  Wait!  Isn’t TCP just UDP with built in ARQ anyway… so is it both?</p>\n<p>The group who open sourced KCP : FML</p>\n<p>I have never collaborated with anyone.  I have been content to toil alone of one off passion projects usually as a passive aggressive way to show disapproval.  Usually when someone insists the company buys something for an insane amount, I disagree, so I build one for under 100 dollars to show my displeasure.  But I have turned over a new leaf.  It is time to be friendly and add to the community that I have borrowed from so many times.  (Real Talk does anyone actually write anything for microcontrollers or do we all troll Github looking for the right header and source files to throw into our project… lord I am lazy… but thank you Peter H… your C++ is soooo clean)</p>\n<p>So if I am not too late… and you haven’t given up.  And you can deal with a very lazy engineer that usually has to read 50 wiki pages to remember something he thought he once already knew before remembering he did the same thing a year ago, documented it, forgot his own naming convention, and just went with it anyway… got a semi-decent results before asking for peer review, being upset by the blunt feedback of half-assery, then locks everyone out of the DC, shutting down TACACS, and goes home to cry.  (final steps, blame your friend who had NOTHING to do with it and pretend like everything is alright, wait for MGMT to be confused by all the nerd babble, more confused non-punishment because no one can actual explain what you did to anyone with the power to fire you, wait for someone else to screw up so you can stop paying for the drinks)</p>\n<p>Also obviously just a little bitter and jaded.  Some how I forgot to lose my native idealism so it hurts anew every time when I fail articulate my ideas for funding because a) I was to technical b) My white paper wasn’t in PowerPoint with pretty pictures c) The VP of Development’s Daughter saw a viral Tik Tok about some new thing we really should be doing (involves data transfer via dance?) d) Tech Crunch just published an article about something with no practical application to the current problem but they DID mange to include pictures e) My Best Friend is still pissed at my last antic and refuses to stop me from publicly drowning.</p>\n<p>If all that is alright with you…</p>\n<p>Then I would love to help you.</p>\n<p>Yeah yeah… I know I went way off point.  I could have said that up front.  Somehow this post became about me and not the project, Sorry?</p>\n<p>If you have moved on… I get it… Still I haven’t had a good nerd rant after a crap week at work for awhile… So thank you.</p>\n<p>PS I still find the time to be an optimist, love my work, and enjoy the beauty of something newly created, still get annoyed when something works and I have no clue why, still mess with it until I break it again, still take the time to laugh at how dumb I am, and try to keep all the fresh faced engineers away from MGMT so they are not lured in or destroyed</p>\n<p>(To the mod that is about to remove this post, take mercy, it is Friday night if you catch my drift)</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2022-06-18T04:12:11.071Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": null,
  "incoming_link_count": 0,
  "reads": 1,
  "score": 0.2,
  "yours": false,
  "topic_id": 122,
  "topic_slug": "racktrack-rack-asset-tracking",
  "display_username": "Devd Roberts",
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "So I realize your post is semi-old-ish... but not as old as Inter-Switch Link was when Cisco finally admitted they lost and killed it.  I see a lot of potential in what you are trying to do.  Most mid-sized/small data centers can not commit to full packaged DCIM platforms.  At that most are modular with almost zero chance of figuring out what is needed (Unless you work for them... looking at you Solar Winds... what the hell is per virtual core physical node basic licensing anyway?  It is like everyone waiting for Oracle to sue them for because we can not figure out how to license something that doesn't exist).  Almost everyone I have seen either gives up or hires a consultant to fix it... and within a year is back to zero.  So even when they try... they still fail.\n\nTypical Customer Conversation\n\nCustomer : I have heard of this cool thing called \"insert Software Solution\" and it only cost 3.99 a month!\n\nMe : Yeah.  3.99 a month for per node connectivity without additional services or configuration\n\nCustomer : Oh cool!  So I must just be a single node!  Lets do it!  Cheap and easy!\n\nMe ....\n\nCustomer : Oh, by the way.  Have you figured out my baseline?\n\nFoundationally physical control is the start point of security.  If it can be touched, it can be owned.  (Anyone remember renaming the CMD.exe to Utilman.exe?)  We have all heard stories of the root bridge being in the closet of a branch office.  Or the 16 year old guy that broke the iPhone hours after release.  Or the annoyed Admin looking for live boot disk and being annoyed it isn't their \"favorite\" distro as they break every known security measure Linux or Windows has to offer?)\n\n90 plus percent of failed infrastructure processes could be avoided by proper asset management.  Raise your hands if you have ever been somewhere that has the most beautiful CM process ever written, super great patching policies, great lifecycle documents... and the first server you touch has some Heartbleed level exploit available because they never attached the hardware to the policy?  (Looking at you DoD, every Federal/state GOVT CIO.... great policy too bad you don't follow them, I just left Amy's Cupcake Factory and her POS network is more secure... good luck on air gap and Security Through Obscurity)\n\nSadly the worst environments for \"baseline\" tracking tend to be the small security enclaves.  (Hey Lockheed, that is a super nice advanced fighter jet China is flying.  What is it called? Is that the F-22 Raptor, opps, nope, must be the MV-22 Osprey, ahh rats... here, just take the F-35.)\n\nWhat I am saying is I see a LOT of potential for what you are proposing here.  I think it needs a lot of up front conversations, the biggest conversation is often the tools of the good guys become the tools of the bad guys.  Knee jerk reactions often mean organizations have already banned the tech that could save them... how can that be overcome? Tell most Security Mangers you are about to deploy RFID tags and they will get their \"faraday cage\" wallets and tin hats, totally forgetting how they just opened the door.  \n\nA very legit strategy is to use same tech but call it something different, no one checks anyway, that is effort.\n\nCompany : We use SMART, Super Modern Asymmetrical Relay Technology, to deliver a super fast stream of information.\n\nCustomer : TAKE MY MONEY\n\nEveryone else : Wait, did they just sell UDP as their own product\n\nor\n\nGoogle : Hey guys we just made this thing called QUIC and we are awesome, it is free (Please ignore the data scraping)\n\nThe World : Thank you for SAVING us from slow internet\n\nEveryone else : Wait, did you add ARQ to UDP? Or just improve TCP with fewer acks?  Wait!  Isn't TCP just UDP with built in ARQ anyway... so is it both?\n\nThe group who open sourced KCP : FML\n\nI have never collaborated with anyone.  I have been content to toil alone of one off passion projects usually as a passive aggressive way to show disapproval.  Usually when someone insists the company buys something for an insane amount, I disagree, so I build one for under 100 dollars to show my displeasure.  But I have turned over a new leaf.  It is time to be friendly and add to the community that I have borrowed from so many times.  (Real Talk does anyone actually write anything for microcontrollers or do we all troll Github looking for the right header and source files to throw into our project... lord I am lazy... but thank you Peter H.... your C++ is soooo clean)\n\nSo if I am not too late... and you haven't given up.  And you can deal with a very lazy engineer that usually has to read 50 wiki pages to remember something he thought he once already knew before remembering he did the same thing a year ago, documented it, forgot his own naming convention, and just went with it anyway... got a semi-decent results before asking for peer review, being upset by the blunt feedback of half-assery, then locks everyone out of the DC, shutting down TACACS, and goes home to cry.  (final steps, blame your friend who had NOTHING to do with it and pretend like everything is alright, wait for MGMT to be confused by all the nerd babble, more confused non-punishment because no one can actual explain what you did to anyone with the power to fire you, wait for someone else to screw up so you can stop paying for the drinks)  \n\nAlso obviously just a little bitter and jaded.  Some how I forgot to lose my native idealism so it hurts anew every time when I fail articulate my ideas for funding because a) I was to technical b) My white paper wasn't in PowerPoint with pretty pictures c) The VP of Development's Daughter saw a viral Tik Tok about some new thing we really should be doing (involves data transfer via dance?) d) Tech Crunch just published an article about something with no practical application to the current problem but they DID mange to include pictures e) My Best Friend is still pissed at my last antic and refuses to stop me from publicly drowning.\n\nIf all that is alright with you...\n\nThen I would love to help you.\n\nYeah yeah.... I know I went way off point.  I could have said that up front.  Somehow this post became about me and not the project, Sorry?\n\nIf you have moved on... I get it..... Still I haven't had a good nerd rant after a crap week at work for awhile... So thank you.\n\nPS I still find the time to be an optimist, love my work, and enjoy the beauty of something newly created, still get annoyed when something works and I have no clue why, still mess with it until I break it again, still take the time to laugh at how dumb I am, and try to keep all the fresh faced engineers away from MGMT so they are not lured in or destroyed\n\n(To the mod that is about to remove this post, take mercy, it is Friday night if you catch my drift)",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1168,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}