{
  "id": 936,
  "name": null,
  "username": "Matthias",
  "avatar_template": "/letter_avatar_proxy/v2/letter/m/cdc98d/{size}.png",
  "created_at": "2023-09-20T21:35:37.639Z",
  "cooked": "<p>In my opinion asking ‘what is the minimal disclosure a project can get away with without falling out of the scooe of certification’ is missing the point of the certification. The mindset is incompatible. The point is to provide the public with all documentation needed to produce the hardware, change the hardware and redistribute those documents while aiming to assist the public in doing so, meaning not only enabling to do so but also making it easy to do so. This especially includes not holding back documents that already exist and play a significant role in reachung the goals mentioned above. If adding the document to a release does not add more unnecessary noise than it does to reach those goals it should be added. The license must be permissive.</p>\n<p>Depending on the projects nature such files can be, but are not limited to, schematics, layouts / boards, 3D / CAD models, BOMs, lists of known good sources of materials and instructions.</p>\n<p>I hope my approach is of any use. To me the question is one of intention amd ethics, not legal definition. There is plethora of ‘open washed’ projects out there that are closed commercial projects, confusing users about the nature of open source and open hardware. This is detrimental to the perception of open *, especially the perception of value open * holds.</p>",
  "post_number": 8,
  "post_type": 1,
  "updated_at": "2023-09-20T21:35:37.639Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "avg_time": 178,
  "incoming_link_count": 0,
  "reads": 2,
  "score": 14.3,
  "yours": false,
  "topic_id": 359,
  "topic_slug": "minimum-of-files-to-comply-with-the-certificate",
  "display_username": null,
  "primary_group_name": null,
  "primary_group_flair_url": null,
  "primary_group_flair_bg_color": null,
  "primary_group_flair_color": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_wiki": false,
  "user_title": null,
  "raw": "In my opinion asking 'what is the minimal disclosure a project can get away with without falling out of the scooe of certification' is missing the point of the certification. The mindset is incompatible. The point is to provide the public with all documentation needed to produce the hardware, change the hardware and redistribute those documents while aiming to assist the public in doing so, meaning not only enabling to do so but also making it easy to do so. This especially includes not holding back documents that already exist and play a significant role in reachung the goals mentioned above. If adding the document to a release does not add more unnecessary noise than it does to reach those goals it should be added. The license must be permissive.\n\nDepending on the projects nature such files can be, but are not limited to, schematics, layouts / boards, 3D / CAD models, BOMs, lists of known good sources of materials and instructions.\n\nI hope my approach is of any use. To me the question is one of intention amd ethics, not legal definition. There is plethora of 'open washed' projects out there that are closed commercial projects, confusing users about the nature of open source and open hardware. This is detrimental to the perception of open *, especially the perception of value open * holds.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1194,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false
}